PaymentCreateAllISPC/results/20211007/BMPaymentV16/PAYCTFORDOMOUTAX_PaymentCreate20211007151623555.txt

Status: UNKNOWN
Time Taken: 1114
Size: 3952
Timestamp: Thu Oct 07 15:16:22 IST 2021
TestStep: PaymentCreate

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V1_6Service
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 4606
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v21" xmlns:urn="urn:pins.payment.edb.com:ws:paymentinitiation:v1_6" xmlns:urn1="urn:pins.payment.edb.com:domain:paymentinitiation:v1_6" xmlns:urn2="urn:pays.payment.edb.com:domain:sepa-complex-types:v4" xmlns:urn3="urn:pays.payment.edb.com:domain:debtor:v1_4" xmlns:urn4="urn:pays.payment.edb.com:domain:creditor:v1_4">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>PIN Create</wsc:Function>
         <wsc:Version>V2_0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>27076402170</wsc:userid>
            <wsc:credentials>03110012010400425kglPboRi3h1Z4YUjUpQ0UB65Ta2kPKj1KWwkWemtrL+SoWqMxx/KuqxUVbNyTu6DsSaabKNt2t+xJppso23a37EmmmyjbdrffJeRiGWfHDGwxCWOpDYc2jgSxAz1+8eEsSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu2xJppso23a37Emmmyjbdrf8wP73CNrvpw=apG4tU0NraPbbqKUp39erKDFa7xy6z+r4VDMr/6qBlkFniGaNeDXv4cZcZZQQI6JtwB3JYQk6WqLA7oyp1FWRM6n46ehgNmHVNly8fTnQbIuGJSF2LUyGI7aE92/dgtp8jv9bsGpNe58K+xb4LeIHwjb2nVVvt4/2oLtDQ8IPJE=</wsc:credentials>
            <wsc:channel>NBA</wsc:channel>
            <wsc:orgid>4201</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>4201</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>27076402170</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item value="27076402170" key="AgreementId"/>
            <wsc:item value="c594f874-a5e9-4f92-9e70-b9bbdef9b5f5" key="LogRef"/>
            <wsc:item key="PaymentChannel" value="BES"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentCreateRequest>
         <urn:paymentMessage>
            <urn1:paymentIdentification>
               <urn2:messageIdentification>4039532</urn2:messageIdentification>
               <urn2:endToEndIdentification>PAYCTFORDOMOUTAX</urn2:endToEndIdentification>
               <!--Optional:-->
            </urn1:paymentIdentification>
            <urn1:paymentInfo>
               <urn3:paymentMethod>TRF</urn3:paymentMethod>
               <!--Optional:-->
               <urn3:paymentTypeInformation>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn3:categoryPurpose>TAXS</urn3:categoryPurpose>
               </urn3:paymentTypeInformation>
               <!--You have a CHOICE of the next 2 items at this level-->
               <urn3:requestedExecutionDate>2021-10-07</urn3:requestedExecutionDate>
               <urn3:debtorAccount>
                  <urn2:identification>34950211433</urn2:identification>
                  <!--Optional:-->
                  <urn2:currency>NOK</urn2:currency>
               </urn3:debtorAccount>
               <urn3:debtorAgentBIC>SPAVNOBBXXX</urn3:debtorAgentBIC>
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
            </urn1:paymentInfo>
            <urn1:transaction>
               <urn4:amount>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <urn2:instructedAmount currency="NOK">
                     <urn2:amount>1</urn2:amount>
                  </urn2:instructedAmount>
               </urn4:amount>
               <!--Optional:-->
               <!--Optional:-->
               <urn4:chargeBearer>DEBT</urn4:chargeBearer>
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <urn4:creditorAccount>
                  <urn2:identification>63450103502</urn2:identification>
                  <!--Optional:-->
               </urn4:creditorAccount>
               <urn1:creditorScorReference>7901807251901190010</urn1:creditorScorReference>
               <!--Optional:-->
               <!--Zero or more repetitions:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
            </urn1:transaction>
            <!--Optional:-->
            <!--Optional:-->
            <!--Optional:-->
         </urn:paymentMessage>
      </urn:PaymentCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 27076402170;4201;27076402170;EVRYCPS;PIN;PINSPayment_V1_6.PaymentCreate;-;c594f874-a5e9-4f92-9e70-b9bbdef9b5f5;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:PaymentCreateResponse xmlns:ns9="urn:srv.pays.payment.fs.evry.com:ws:agreementcapture:v1_0" xmlns:ns8="urn:srv.stord.fs.evry.com:domain:common:v1" xmlns:ns7="urn:pays.payment.edb.com:domain:creditor:v1_4" xmlns:ns6="urn:pays.payment.edb.com:domain:debtor:v1_4" xmlns:ns5="urn:pays.payment.edb.com:domain:sepa-complex-types:v4" xmlns:ns4="urn:pins.payment.edb.com:domain:paymentinitiation:v1_6" xmlns:ns3="urn:pays.payment.edb.com:domain:edb-types:v1" xmlns:ns2="urn:pins.payment.edb.com:ws:paymentinitiation:v1_6" xmlns="http://edb.com/ws/WSCommon_v21">
         <ns3:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <StrErrorCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <Message>OK</Message>
            <NativeError xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         </ns3:ResponseState>
         <ns2:paymentResult>
            <ns4:messageId>1025513</ns4:messageId>
            <ns4:paymentInfoId>1118962</ns4:paymentInfoId>
            <ns4:transactionId>260896928</ns4:transactionId>
            <ns4:paymentReference>260896928</ns4:paymentReference>
            <ns4:paymentAmounts>
               <ns5:debitAmount currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:debitAmount>
               <ns5:creditAmount currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:creditAmount>
               <ns5:debitCounterValue currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:debitCounterValue>
               <ns5:creditCounterValue currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:creditCounterValue>
               <ns5:conversionRateInfo>
                  <ns5:rate>1</ns5:rate>
                  <ns5:type>NONE</ns5:type>
                  <ns5:unitNumber>1</ns5:unitNumber>
               </ns5:conversionRateInfo>
            </ns4:paymentAmounts>
            <ns4:releaseDate>2021-10-07+02:00</ns4:releaseDate>
            <ns4:paymentType>FOREIGN_DOMESTIC_TAX</ns4:paymentType>
            <ns4:paymentProduct>PI Domestic</ns4:paymentProduct>
            <ns4:transactionFee currency="NOK">
               <ns5:amount>25.00</ns5:amount>
            </ns4:transactionFee>
            <ns4:additionalServiceCharge>
               <ns5:serviceName>Outward OUR</ns5:serviceName>
               <ns5:charge currency="NOK">
                  <ns5:amount>2.50</ns5:amount>
               </ns5:charge>
            </ns4:additionalServiceCharge>
            <ns4:paymentIdentification>
               <ns5:messageIdentification>4039532</ns5:messageIdentification>
               <ns5:endToEndIdentification>PAYCTFORDOMOUTAX</ns5:endToEndIdentification>
            </ns4:paymentIdentification>
            <ns4:groupHeader>
               <ns5:creationDateTime>2021-10-07T11:46:22.342+02:00</ns5:creationDateTime>
            </ns4:groupHeader>
            <ns4:paymentInfo>
               <ns6:paymentMethod>TRF</ns6:paymentMethod>
               <ns6:paymentTypeInformation>
                  <ns6:instructionPriority>NORM</ns6:instructionPriority>
                  <ns6:categoryPurpose>TAXS</ns6:categoryPurpose>
               </ns6:paymentTypeInformation>
               <ns6:requestedExecutionDate>2021-10-07+02:00</ns6:requestedExecutionDate>
               <ns6:debtorAccount>
                  <ns5:identification>34950211433</ns5:identification>
                  <ns5:currency>NOK</ns5:currency>
               </ns6:debtorAccount>
               <ns6:debtorAgentBIC>SPAVNOBBXXX</ns6:debtorAgentBIC>
               <ns6:debtor>
                  <ns5:name>Amy Hallstein Walderhaug</ns5:name>
                  <ns5:postalAddress>
                     <ns5:postCode>3711</ns5:postCode>
                     <ns5:townName>SKIEN</ns5:townName>
                     <ns5:country>NO</ns5:country>
                     <ns5:addressLine>STENSLI</ns5:addressLine>
                  </ns5:postalAddress>
               </ns6:debtor>
            </ns4:paymentInfo>
            <ns4:transaction>
               <ns7:amount>
                  <ns5:instructedAmount currency="NOK">
                     <ns5:amount>1.00</ns5:amount>
                  </ns5:instructedAmount>
               </ns7:amount>
               <ns7:chargeBearer>DEBT</ns7:chargeBearer>
               <ns7:creditorAgent>
                  <ns5:nationalId>6001</ns5:nationalId>
                  <ns5:postalAddress>
                     <ns5:country>NO</ns5:country>
                  </ns5:postalAddress>
               </ns7:creditorAgent>
               <ns7:creditor>
                  <ns5:name>Konsert ryddere ANS.</ns5:name>
                  <ns5:postalAddress>
                     <ns5:country>NO</ns5:country>
                  </ns5:postalAddress>
               </ns7:creditor>
               <ns7:creditorAccount>
                  <ns5:identification>63450103502</ns5:identification>
               </ns7:creditorAccount>
               <ns7:confidential>false</ns7:confidential>
               <ns4:creditorScorReference>7901807251901190010</ns4:creditorScorReference>
            </ns4:transaction>
         </ns2:paymentResult>
      </ns2:PaymentCreateResponse>
   </soap:Body>
</soap:Envelope>
